# Learning Logs

날짜별 학습 기록을 남깁니다.

## 기록 양식

- 날짜: 2026.10.19
- 오늘 배운 것: 은행 입출금 방식을 (입금,출금,종료)의 메뉴와 현재 잔액, 입금후 잔액, 출금후 잔액을 나타내는 프로그램을 만들었습니다.
- 해 본 코드/링크:
m=0
b=0
while True:
    ask=input("원하는 메뉴를 입력하세요.입금/출금/종료:")
    if ask == "입금":
        b=int(input("입금할 금액을 입력하세요:"))
        m=m+b
        print(f"현재잔액은{m}원 입니다.")
        
    elif ask =="출금":
        b=int(input("출금할 금액을 입력하세요:"))
        if b>m:
            print("잔액이 부족합니다.")
        else:
            m=m-b
            print(f"현재잔액은{m}원 입니다.")

    elif ask == "종료":
        print("프로그램을 종료합니다.")
        break

  
- 막힌 점과 해결:
  처음에 어떤 항목을 몇개를 만들고 어떤값을 주어야 하는지 부터 막혔습니다.
  ( 만들어야할 프로그램에서 무엇이 주이고 부인지 부터 선별하고 구별해 필요한 변수와 값을 정리하였습니다. m=0, b=0 / m=나의 현재 잔액 , b=내가 넣고 빼는 금액)

- 다음에 할 일:  
